app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist", "time", "favorite", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Fallingwater"], ["artist", "Maggie Rogers"], ["time", "4:31"], ["favorite", false], ["created_at", "2020-11-17 01:10:16.540501"], ["updated_at", "2020-11-17 01:10:16.540501"]]
---
  def create
    @song = Song.new(song_params)

    if @song.save

UPDATE "songs" SET "title" = $1, "artist" = $2, "time" = $3, "updated_at" = $4 WHERE "songs"."id" = $5  [["title", "Test 2"], ["artist", "Test  2"], ["time", "3:06"], ["updated_at", "2020-11-17 01:27:41.872080"], ["id", 10]]
---
  def update
    if @song.update(song_params)